#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

[32m[1mSuccess![0m The configuration is valid.
[0m

```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_id.bucket_name: Refreshing state... [id=dWipEA]
data.archive_file.visitor_count: Reading...
data.archive_file.visitor_count: Read complete after 0s [id=dd129a73283f310fd1f8654cf4b9fc665ddd7af3]
data.aws_route53_zone.root: Reading...
module.s3_cf_logging.data.aws_caller_identity.current: Reading...
aws_dynamodb_table.stats-db: Refreshing state... [id=main-cloud-resume-stats]
module.s3_cf_logging.aws_s3_bucket.this[0]: Refreshing state... [id=kyle.mn-1969793296-logs]
data.aws_iam_policy_document.lambda_logging: Reading...
data.aws_iam_policy_document.lambda_assume_role: Reading...
module.s3_bucket_for_website.data.aws_caller_identity.current: Reading...
module.s3_bucket_for_website.aws_s3_bucket.this[0]: Refreshing state... [id=kyle.mn-1969793296]
module.s3_bucket_for_website.data.aws_partition.current: Reading...
data.aws_iam_policy_document.lambda_assume_role: Read complete after 0s [id=2690255455]
module.s3_bucket_for_website.data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_iam_policy_document.lambda_logging: Read complete after 0s [id=3546645223]
module.s3_cf_logging.data.aws_partition.current: Reading...
module.s3_cf_logging.data.aws_region.current: Reading...
module.s3_bucket_for_website.data.aws_region.current: Reading...
module.s3_cf_logging.data.aws_region.current: Read complete after 0s [id=us-east-2]
module.s3_cf_logging.data.aws_partition.current: Read complete after 0s [id=aws]
module.s3_bucket_for_website.data.aws_region.current: Read complete after 0s [id=us-east-2]
module.s3_cf_logging.data.aws_canonical_user_id.this: Reading...
module.s3_bucket_for_website.data.aws_canonical_user_id.this: Reading...
aws_apigatewayv2_api.visitor_count: Refreshing state... [id=4wl32dvibh]
module.s3_cf_logging.data.aws_caller_identity.current: Read complete after 1s [id=382878041746]
aws_iam_role.iam_for_lambda: Refreshing state... [id=main-iam_role_for_lambda]
aws_iam_policy.lambda_logging: Refreshing state... [id=arn:aws:iam::382878041746:policy/main-lambda_logging]
module.s3_bucket_for_website.data.aws_caller_identity.current: Read complete after 1s [id=382878041746]
aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:382878041746:certificate/6b878116-393e-4a75-bfe9-56804a7de985]
module.s3_cf_logging.data.aws_canonical_user_id.this: Read complete after 1s [id=75b2b91820e9df6396fa564ef6186398e526c762eeefb9493f7dbd98d55a6dd1]
module.s3_bucket_for_website.data.aws_canonical_user_id.this: Read complete after 1s [id=75b2b91820e9df6396fa564ef6186398e526c762eeefb9493f7dbd98d55a6dd1]
data.aws_route53_zone.root: Read complete after 1s [id=Z061938037NWWQYAL4QNW]
aws_appautoscaling_target.dynamodb_table_read_target: Refreshing state... [id=table/main-cloud-resume-stats]
data.aws_iam_policy_document.lambda_execution: Reading...
aws_appautoscaling_target.dynamodb_table_write_target: Refreshing state... [id=table/main-cloud-resume-stats]
data.aws_iam_policy_document.lambda_execution: Read complete after 0s [id=2762867420]
aws_iam_policy.lambda_execution: Refreshing state... [id=arn:aws:iam::382878041746:policy/main-lambda_execution]
aws_route53_record.cert["kyle.mn"]: Refreshing state... [id=Z061938037NWWQYAL4QNW__329be233e71691df0ac5faa78ba5485b.kyle.mn._CNAME]
aws_acm_certificate_validation.cert: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
aws_iam_role_policy_attachment.lambda_logging: Refreshing state... [id=main-iam_role_for_lambda-20230721175420113000000001]
aws_lambda_function.visitor_count: Refreshing state... [id=main_increment_visitor_count]
aws_iam_role_policy_attachment.lambda_execution: Refreshing state... [id=main-iam_role_for_lambda-20230721175426538200000003]
aws_appautoscaling_policy.dynamodb_table_read_policy: Refreshing state... [id=DynamoDBReadCapacityUtilization:table/main-cloud-resume-stats]
aws_appautoscaling_policy.dynamodb_table_write_policy: Refreshing state... [id=DynamoDBWriteCapacityUtilization:table/main-cloud-resume-stats]
aws_apigatewayv2_integration.visitor_count: Refreshing state... [id=4heyu00]
aws_lambda_permission.visitor_count: Refreshing state... [id=main-AllowVisitorCountAPIInvoke]
module.s3_cf_logging.aws_s3_bucket_versioning.this[0]: Refreshing state... [id=kyle.mn-1969793296-logs]
module.s3_cf_logging.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=kyle.mn-1969793296-logs]
module.s3_cf_logging.data.aws_iam_policy_document.combined[0]: Reading...
module.s3_cf_logging.data.aws_iam_policy_document.combined[0]: Read complete after 0s [id=3283479026]
module.s3_bucket_for_website.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=kyle.mn-1969793296]
module.s3_bucket_for_website.aws_s3_bucket_versioning.this[0]: Refreshing state... [id=kyle.mn-1969793296]
aws_cloudfront_origin_access_control.s3_oac: Refreshing state... [id=E1OCM2RXERGY3B]
module.s3_cf_logging.aws_s3_bucket_policy.this[0]: Refreshing state... [id=kyle.mn-1969793296-logs]
aws_apigatewayv2_route.visitor_count: Refreshing state... [id=mo8wooi]
module.s3_cf_logging.aws_s3_bucket_ownership_controls.this[0]: Refreshing state... [id=kyle.mn-1969793296-logs]
module.s3_bucket_for_website.aws_s3_bucket_logging.this[0]: Refreshing state... [id=kyle.mn-1969793296]
aws_apigatewayv2_stage.visitor_count: Refreshing state... [id=v1]
module.s3_cf_logging.aws_s3_bucket_acl.this[0]: Refreshing state... [id=kyle.mn-1969793296-logs,log-delivery-write]
aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E2YJOOQOUGDCM]
aws_route53_record.dns_record: Refreshing state... [id=Z061938037NWWQYAL4QNW_kyle.mn_A]
module.s3_bucket_for_website.data.aws_iam_policy_document.combined[0]: Reading...
module.s3_bucket_for_website.data.aws_iam_policy_document.combined[0]: Read complete after 0s [id=745461122]
module.s3_bucket_for_website.aws_s3_bucket_policy.this[0]: Refreshing state... [id=kyle.mn-1969793296]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_appautoscaling_target.dynamodb_table_read_target has been deleted
  - resource "aws_appautoscaling_target" "dynamodb_table_read_target" {
        id                 = "table/main-cloud-resume-stats"
      - resource_id        = "table/main-cloud-resume-stats" -> null
      - scalable_dimension = "dynamodb:table:ReadCapacityUnits" -> null
      - service_namespace  = "dynamodb" -> null
        tags               = {}
        # (5 unchanged attributes hidden)
    }

  # aws_appautoscaling_target.dynamodb_table_write_target has been deleted
  - resource "aws_appautoscaling_target" "dynamodb_table_write_target" {
        id                 = "table/main-cloud-resume-stats"
      - resource_id        = "table/main-cloud-resume-stats" -> null
      - scalable_dimension = "dynamodb:table:WriteCapacityUnits" -> null
      - service_namespace  = "dynamodb" -> null
        tags               = {}
        # (5 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_appautoscaling_policy.dynamodb_table_read_policy will be created
  + resource "aws_appautoscaling_policy" "dynamodb_table_read_policy" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "DynamoDBReadCapacityUtilization:table/main-cloud-resume-stats"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "table/main-cloud-resume-stats"
      + scalable_dimension = "dynamodb:table:ReadCapacityUnits"
      + service_namespace  = "dynamodb"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in = false
          + target_value     = 70

          + predefined_metric_specification {
              + predefined_metric_type = "DynamoDBReadCapacityUtilization"
            }
        }
    }

  # aws_appautoscaling_policy.dynamodb_table_write_policy will be created
  + resource "aws_appautoscaling_policy" "dynamodb_table_write_policy" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "DynamoDBWriteCapacityUtilization:table/main-cloud-resume-stats"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "table/main-cloud-resume-stats"
      + scalable_dimension = "dynamodb:table:WriteCapacityUnits"
      + service_namespace  = "dynamodb"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in = false
          + target_value     = 70

          + predefined_metric_specification {
              + predefined_metric_type = "DynamoDBWriteCapacityUtilization"
            }
        }
    }

  # aws_appautoscaling_target.dynamodb_table_read_target will be created
  + resource "aws_appautoscaling_target" "dynamodb_table_read_target" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 10
      + min_capacity       = 1
      + resource_id        = "table/main-cloud-resume-stats"
      + role_arn           = (known after apply)
      + scalable_dimension = "dynamodb:table:ReadCapacityUnits"
      + service_namespace  = "dynamodb"
      + tags_all           = (known after apply)
    }

  # aws_appautoscaling_target.dynamodb_table_write_target will be created
  + resource "aws_appautoscaling_target" "dynamodb_table_write_target" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 10
      + min_capacity       = 1
      + resource_id        = "table/main-cloud-resume-stats"
      + role_arn           = (known after apply)
      + scalable_dimension = "dynamodb:table:WriteCapacityUnits"
      + service_namespace  = "dynamodb"
      + tags_all           = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @elykkyle, Action: `pull_request`, Working Directory: ``, Workflow: `Plan deployment to prod`*